load-test/results/baseline-stress.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load-test/product-list-stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 3m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 003/200 VUs, 31 complete and 0 interrupted iterations
default   [   1% ] 003/200 VUs  0m01.0s/3m00.0s

running (0m02.0s), 005/200 VUs, 99 complete and 0 interrupted iterations
default   [   1% ] 005/200 VUs  0m02.0s/3m00.0s

running (0m03.0s), 008/200 VUs, 188 complete and 0 interrupted iterations
default   [   2% ] 008/200 VUs  0m03.0s/3m00.0s

running (0m04.0s), 010/200 VUs, 279 complete and 0 interrupted iterations
default   [   2% ] 010/200 VUs  0m04.0s/3m00.0s

running (0m05.0s), 013/200 VUs, 381 complete and 0 interrupted iterations
default   [   3% ] 013/200 VUs  0m05.0s/3m00.0s

running (0m06.0s), 015/200 VUs, 484 complete and 0 interrupted iterations
default   [   3% ] 015/200 VUs  0m06.0s/3m00.0s

running (0m07.0s), 018/200 VUs, 610 complete and 0 interrupted iterations
default   [   4% ] 018/200 VUs  0m07.0s/3m00.0s

running (0m08.0s), 020/200 VUs, 730 complete and 0 interrupted iterations
default   [   4% ] 020/200 VUs  0m08.0s/3m00.0s

running (0m09.0s), 022/200 VUs, 835 complete and 0 interrupted iterations
default   [   5% ] 022/200 VUs  0m09.0s/3m00.0s

running (0m10.0s), 025/200 VUs, 945 complete and 0 interrupted iterations
default   [   6% ] 025/200 VUs  0m10.0s/3m00.0s

running (0m11.0s), 027/200 VUs, 1050 complete and 0 interrupted iterations
default   [   6% ] 027/200 VUs  0m11.0s/3m00.0s

running (0m12.0s), 030/200 VUs, 1145 complete and 0 interrupted iterations
default   [   7% ] 030/200 VUs  0m12.0s/3m00.0s

running (0m13.0s), 032/200 VUs, 1256 complete and 0 interrupted iterations
default   [   7% ] 032/200 VUs  0m13.0s/3m00.0s

running (0m14.0s), 035/200 VUs, 1358 complete and 0 interrupted iterations
default   [   8% ] 035/200 VUs  0m14.0s/3m00.0s

running (0m15.0s), 037/200 VUs, 1442 complete and 0 interrupted iterations
default   [   8% ] 037/200 VUs  0m15.0s/3m00.0s

running (0m16.0s), 040/200 VUs, 1568 complete and 0 interrupted iterations
default   [   9% ] 040/200 VUs  0m16.0s/3m00.0s

running (0m17.0s), 042/200 VUs, 1686 complete and 0 interrupted iterations
default   [   9% ] 042/200 VUs  0m17.0s/3m00.0s

running (0m18.0s), 045/200 VUs, 1812 complete and 0 interrupted iterations
default   [  10% ] 045/200 VUs  0m18.0s/3m00.0s

running (0m18.9s), 047/200 VUs, 1942 complete and 0 interrupted iterations
default   [  11% ] 047/200 VUs  0m19.0s/3m00.0s

running (0m19.9s), 049/200 VUs, 2028 complete and 0 interrupted iterations
default   [  11% ] 049/200 VUs  0m20.0s/3m00.0s

running (0m20.9s), 050/200 VUs, 2068 complete and 0 interrupted iterations
default   [  12% ] 050/200 VUs  0m21.0s/3m00.0s

running (0m21.9s), 050/200 VUs, 2142 complete and 0 interrupted iterations
default   [  12% ] 050/200 VUs  0m22.0s/3m00.0s

running (0m22.9s), 050/200 VUs, 2218 complete and 0 interrupted iterations
default   [  13% ] 050/200 VUs  0m23.0s/3m00.0s

running (0m23.9s), 050/200 VUs, 2293 complete and 0 interrupted iterations
default   [  13% ] 050/200 VUs  0m24.0s/3m00.0s

running (0m24.9s), 050/200 VUs, 2396 complete and 0 interrupted iterations
default   [  14% ] 050/200 VUs  0m25.0s/3m00.0s

running (0m25.9s), 050/200 VUs, 2495 complete and 0 interrupted iterations
default   [  14% ] 050/200 VUs  0m26.0s/3m00.0s

running (0m26.9s), 050/200 VUs, 2610 complete and 0 interrupted iterations
default   [  15% ] 050/200 VUs  0m27.0s/3m00.0s

running (0m27.9s), 050/200 VUs, 2720 complete and 0 interrupted iterations
default   [  16% ] 050/200 VUs  0m28.0s/3m00.0s

running (0m28.9s), 050/200 VUs, 2848 complete and 0 interrupted iterations
default   [  16% ] 050/200 VUs  0m29.0s/3m00.0s

running (0m29.9s), 050/200 VUs, 2949 complete and 0 interrupted iterations
default   [  17% ] 050/200 VUs  0m30.0s/3m00.0s

running (0m30.9s), 050/200 VUs, 3057 complete and 0 interrupted iterations
default   [  17% ] 050/200 VUs  0m31.0s/3m00.0s

running (0m31.9s), 050/200 VUs, 3163 complete and 0 interrupted iterations
default   [  18% ] 050/200 VUs  0m32.0s/3m00.0s

running (0m32.9s), 050/200 VUs, 3274 complete and 0 interrupted iterations
default   [  18% ] 050/200 VUs  0m33.0s/3m00.0s

running (0m33.9s), 050/200 VUs, 3383 complete and 0 interrupted iterations
default   [  19% ] 050/200 VUs  0m34.0s/3m00.0s

running (0m34.9s), 050/200 VUs, 3491 complete and 0 interrupted iterations
default   [  19% ] 050/200 VUs  0m35.0s/3m00.0s

running (0m35.9s), 050/200 VUs, 3603 complete and 0 interrupted iterations
default   [  20% ] 050/200 VUs  0m36.0s/3m00.0s

running (0m36.9s), 050/200 VUs, 3729 complete and 0 interrupted iterations
default   [  21% ] 050/200 VUs  0m37.0s/3m00.0s

running (0m37.9s), 050/200 VUs, 3860 complete and 0 interrupted iterations
default   [  21% ] 050/200 VUs  0m38.0s/3m00.0s

running (0m38.9s), 050/200 VUs, 3996 complete and 0 interrupted iterations
default   [  22% ] 050/200 VUs  0m39.0s/3m00.0s

running (0m39.9s), 050/200 VUs, 4131 complete and 0 interrupted iterations
default   [  22% ] 050/200 VUs  0m40.0s/3m00.0s

running (0m40.9s), 050/200 VUs, 4269 complete and 0 interrupted iterations
default   [  23% ] 050/200 VUs  0m41.0s/3m00.0s

running (0m41.9s), 050/200 VUs, 4408 complete and 0 interrupted iterations
default   [  23% ] 050/200 VUs  0m42.0s/3m00.0s

running (0m42.9s), 050/200 VUs, 4532 complete and 0 interrupted iterations
default   [  24% ] 050/200 VUs  0m43.0s/3m00.0s

running (0m43.9s), 050/200 VUs, 4662 complete and 0 interrupted iterations
default   [  24% ] 050/200 VUs  0m44.0s/3m00.0s

running (0m44.9s), 050/200 VUs, 4783 complete and 0 interrupted iterations
default   [  25% ] 050/200 VUs  0m45.0s/3m00.0s

running (0m45.9s), 050/200 VUs, 4917 complete and 0 interrupted iterations
default   [  26% ] 050/200 VUs  0m46.0s/3m00.0s

running (0m46.9s), 050/200 VUs, 5053 complete and 0 interrupted iterations
default   [  26% ] 050/200 VUs  0m47.0s/3m00.0s

running (0m47.9s), 050/200 VUs, 5191 complete and 0 interrupted iterations
default   [  27% ] 050/200 VUs  0m48.0s/3m00.0s

running (0m48.8s), 050/200 VUs, 5282 complete and 0 interrupted iterations
default   [  27% ] 050/200 VUs  0m49.0s/3m00.0s

running (0m49.8s), 050/200 VUs, 5361 complete and 0 interrupted iterations
default   [  28% ] 050/200 VUs  0m50.0s/3m00.0s

running (0m50.8s), 052/200 VUs, 5414 complete and 0 interrupted iterations
default   [  28% ] 052/200 VUs  0m51.0s/3m00.0s

running (0m51.8s), 054/200 VUs, 5493 complete and 0 interrupted iterations
default   [  29% ] 054/200 VUs  0m52.0s/3m00.0s

running (0m52.8s), 057/200 VUs, 5589 complete and 0 interrupted iterations
default   [  29% ] 057/200 VUs  0m53.0s/3m00.0s

running (0m53.8s), 059/200 VUs, 5709 complete and 0 interrupted iterations
default   [  30% ] 059/200 VUs  0m54.0s/3m00.0s

running (0m54.8s), 062/200 VUs, 5844 complete and 0 interrupted iterations
default   [  31% ] 062/200 VUs  0m55.0s/3m00.0s

running (0m55.8s), 064/200 VUs, 5976 complete and 0 interrupted iterations
default   [  31% ] 064/200 VUs  0m56.0s/3m00.0s

running (0m56.8s), 067/200 VUs, 6111 complete and 0 interrupted iterations
default   [  32% ] 067/200 VUs  0m57.0s/3m00.0s

running (0m57.8s), 069/200 VUs, 6230 complete and 0 interrupted iterations
default   [  32% ] 069/200 VUs  0m58.0s/3m00.0s

running (0m58.8s), 072/200 VUs, 6335 complete and 0 interrupted iterations
default   [  33% ] 072/200 VUs  0m59.0s/3m00.0s

running (0m59.8s), 074/200 VUs, 6393 complete and 0 interrupted iterations
default   [  33% ] 074/200 VUs  1m00.0s/3m00.0s

running (1m00.8s), 077/200 VUs, 6487 complete and 0 interrupted iterations
default   [  34% ] 077/200 VUs  1m01.0s/3m00.0s

running (1m01.8s), 079/200 VUs, 6548 complete and 0 interrupted iterations
default   [  34% ] 079/200 VUs  1m02.0s/3m00.0s

running (1m02.8s), 082/200 VUs, 6592 complete and 0 interrupted iterations
default   [  35% ] 082/200 VUs  1m03.0s/3m00.0s

running (1m03.8s), 084/200 VUs, 6645 complete and 0 interrupted iterations
default   [  36% ] 084/200 VUs  1m04.0s/3m00.0s

running (1m04.8s), 087/200 VUs, 6720 complete and 0 interrupted iterations
default   [  36% ] 087/200 VUs  1m05.0s/3m00.0s

running (1m05.8s), 089/200 VUs, 6801 complete and 0 interrupted iterations
default   [  37% ] 089/200 VUs  1m06.0s/3m00.0s

running (1m06.8s), 092/200 VUs, 6891 complete and 0 interrupted iterations
default   [  37% ] 092/200 VUs  1m07.0s/3m00.0s

running (1m07.8s), 094/200 VUs, 6965 complete and 0 interrupted iterations
default   [  38% ] 094/200 VUs  1m08.0s/3m00.0s

running (1m08.8s), 097/200 VUs, 7043 complete and 0 interrupted iterations
default   [  38% ] 097/200 VUs  1m09.0s/3m00.0s

running (1m09.8s), 099/200 VUs, 7109 complete and 0 interrupted iterations
default   [  39% ] 099/200 VUs  1m10.0s/3m00.0s

running (1m10.8s), 100/200 VUs, 7196 complete and 0 interrupted iterations
default   [  39% ] 100/200 VUs  1m11.0s/3m00.0s

running (1m11.8s), 100/200 VUs, 7255 complete and 0 interrupted iterations
default   [  40% ] 100/200 VUs  1m12.0s/3m00.0s

running (1m12.8s), 100/200 VUs, 7328 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  1m13.0s/3m00.0s

running (1m13.8s), 100/200 VUs, 7402 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  1m14.0s/3m00.0s

running (1m14.8s), 100/200 VUs, 7492 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  1m15.0s/3m00.0s

running (1m15.8s), 100/200 VUs, 7589 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  1m16.0s/3m00.0s

running (1m16.8s), 100/200 VUs, 7693 complete and 0 interrupted iterations
default   [  43% ] 100/200 VUs  1m17.0s/3m00.0s

running (1m17.8s), 100/200 VUs, 7767 complete and 0 interrupted iterations
default   [  43% ] 100/200 VUs  1m18.0s/3m00.0s

running (1m18.7s), 100/200 VUs, 7855 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  1m19.0s/3m00.0s

running (1m19.7s), 100/200 VUs, 7958 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  1m20.0s/3m00.0s

running (1m20.7s), 100/200 VUs, 8056 complete and 0 interrupted iterations
default   [  45% ] 100/200 VUs  1m21.0s/3m00.0s

running (1m21.7s), 100/200 VUs, 8170 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  1m22.0s/3m00.0s

running (1m22.7s), 100/200 VUs, 8274 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  1m23.0s/3m00.0s

running (1m23.7s), 100/200 VUs, 8385 complete and 0 interrupted iterations
default   [  47% ] 100/200 VUs  1m24.0s/3m00.0s

running (1m24.7s), 100/200 VUs, 8494 complete and 0 interrupted iterations
default   [  47% ] 100/200 VUs  1m25.0s/3m00.0s

running (1m25.7s), 100/200 VUs, 8603 complete and 0 interrupted iterations
default   [  48% ] 100/200 VUs  1m26.0s/3m00.0s

running (1m26.7s), 100/200 VUs, 8710 complete and 0 interrupted iterations
default   [  48% ] 100/200 VUs  1m27.0s/3m00.0s

running (1m27.7s), 100/200 VUs, 8803 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  1m28.0s/3m00.0s

running (1m28.7s), 100/200 VUs, 8915 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  1m29.0s/3m00.0s

running (1m29.7s), 100/200 VUs, 9005 complete and 0 interrupted iterations
default   [  50% ] 100/200 VUs  1m30.0s/3m00.0s

running (1m30.7s), 100/200 VUs, 9098 complete and 0 interrupted iterations
default   [  51% ] 100/200 VUs  1m31.0s/3m00.0s

running (1m31.7s), 100/200 VUs, 9203 complete and 0 interrupted iterations
default   [  51% ] 100/200 VUs  1m32.0s/3m00.0s

running (1m32.7s), 100/200 VUs, 9290 complete and 0 interrupted iterations
default   [  52% ] 100/200 VUs  1m33.0s/3m00.0s

running (1m33.7s), 100/200 VUs, 9392 complete and 0 interrupted iterations
default   [  52% ] 100/200 VUs  1m34.0s/3m00.0s

running (1m34.7s), 100/200 VUs, 9508 complete and 0 interrupted iterations
default   [  53% ] 100/200 VUs  1m35.0s/3m00.0s

running (1m35.7s), 100/200 VUs, 9622 complete and 0 interrupted iterations
default   [  53% ] 100/200 VUs  1m36.0s/3m00.0s

running (1m36.7s), 100/200 VUs, 9734 complete and 0 interrupted iterations
default   [  54% ] 100/200 VUs  1m37.0s/3m00.0s

running (1m37.7s), 100/200 VUs, 9840 complete and 0 interrupted iterations
default   [  54% ] 100/200 VUs  1m38.0s/3m00.0s

running (1m38.7s), 100/200 VUs, 9953 complete and 0 interrupted iterations
default   [  55% ] 100/200 VUs  1m39.0s/3m00.0s

running (1m39.7s), 100/200 VUs, 10059 complete and 0 interrupted iterations
default   [  56% ] 100/200 VUs  1m40.0s/3m00.0s

running (1m40.7s), 104/200 VUs, 10170 complete and 0 interrupted iterations
default   [  56% ] 104/200 VUs  1m41.0s/3m00.0s

running (1m41.7s), 109/200 VUs, 10273 complete and 0 interrupted iterations
default   [  57% ] 109/200 VUs  1m42.0s/3m00.0s

running (1m42.7s), 114/200 VUs, 10381 complete and 0 interrupted iterations
default   [  57% ] 114/200 VUs  1m43.0s/3m00.0s

running (1m43.7s), 119/200 VUs, 10460 complete and 0 interrupted iterations
default   [  58% ] 119/200 VUs  1m44.0s/3m00.0s

running (1m44.7s), 124/200 VUs, 10575 complete and 0 interrupted iterations
default   [  58% ] 124/200 VUs  1m45.0s/3m00.0s

running (1m45.7s), 129/200 VUs, 10681 complete and 0 interrupted iterations
default   [  59% ] 129/200 VUs  1m46.0s/3m00.0s

running (1m46.7s), 134/200 VUs, 10781 complete and 0 interrupted iterations
default   [  59% ] 134/200 VUs  1m47.0s/3m00.0s

running (1m47.7s), 139/200 VUs, 10902 complete and 0 interrupted iterations
default   [  60% ] 139/200 VUs  1m48.0s/3m00.0s

running (1m48.6s), 144/200 VUs, 11020 complete and 0 interrupted iterations
default   [  61% ] 144/200 VUs  1m49.0s/3m00.0s

running (1m49.6s), 149/200 VUs, 11125 complete and 0 interrupted iterations
default   [  61% ] 149/200 VUs  1m50.0s/3m00.0s

running (1m50.6s), 154/200 VUs, 11236 complete and 0 interrupted iterations
default   [  62% ] 154/200 VUs  1m51.0s/3m00.0s

running (1m51.6s), 159/200 VUs, 11343 complete and 0 interrupted iterations
default   [  62% ] 159/200 VUs  1m52.0s/3m00.0s

running (1m52.6s), 164/200 VUs, 11460 complete and 0 interrupted iterations
default   [  63% ] 164/200 VUs  1m53.0s/3m00.0s

running (1m53.6s), 169/200 VUs, 11582 complete and 0 interrupted iterations
default   [  63% ] 169/200 VUs  1m54.0s/3m00.0s

running (1m54.6s), 174/200 VUs, 11699 complete and 0 interrupted iterations
default   [  64% ] 174/200 VUs  1m55.0s/3m00.0s

running (1m55.6s), 179/200 VUs, 11817 complete and 0 interrupted iterations
default   [  64% ] 179/200 VUs  1m56.0s/3m00.0s

running (1m56.6s), 184/200 VUs, 11931 complete and 0 interrupted iterations
default   [  65% ] 184/200 VUs  1m57.0s/3m00.0s

running (1m57.6s), 189/200 VUs, 12046 complete and 0 interrupted iterations
default   [  66% ] 189/200 VUs  1m58.0s/3m00.0s

running (1m58.6s), 194/200 VUs, 12150 complete and 0 interrupted iterations
default   [  66% ] 194/200 VUs  1m59.0s/3m00.0s

running (1m59.6s), 199/200 VUs, 12261 complete and 0 interrupted iterations
default   [  67% ] 199/200 VUs  2m00.0s/3m00.0s

running (2m00.6s), 200/200 VUs, 12363 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  2m01.0s/3m00.0s

running (2m01.6s), 200/200 VUs, 12471 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m02.0s/3m00.0s

running (2m02.6s), 200/200 VUs, 12551 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m03.0s/3m00.0s

running (2m03.6s), 200/200 VUs, 12653 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m04.0s/3m00.0s

running (2m04.6s), 200/200 VUs, 12759 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m05.0s/3m00.0s

running (2m05.6s), 200/200 VUs, 12866 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  2m06.0s/3m00.0s

running (2m06.6s), 200/200 VUs, 12985 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  2m07.0s/3m00.0s

running (2m07.6s), 200/200 VUs, 13110 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  2m08.0s/3m00.0s

running (2m08.6s), 200/200 VUs, 13223 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m09.0s/3m00.0s

running (2m09.6s), 200/200 VUs, 13294 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m10.0s/3m00.0s

running (2m10.6s), 200/200 VUs, 13370 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m11.0s/3m00.0s

running (2m11.6s), 200/200 VUs, 13463 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m12.0s/3m00.0s

running (2m12.6s), 200/200 VUs, 13561 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m13.0s/3m00.0s

running (2m13.6s), 200/200 VUs, 13633 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m14.0s/3m00.0s

running (2m14.6s), 200/200 VUs, 13731 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  2m15.0s/3m00.0s

running (2m15.6s), 200/200 VUs, 13833 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  2m16.0s/3m00.0s

running (2m16.6s), 200/200 VUs, 13913 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  2m17.0s/3m00.0s

running (2m17.6s), 200/200 VUs, 14018 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  2m18.0s/3m00.0s

running (2m18.6s), 200/200 VUs, 14110 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  2m19.0s/3m00.0s

running (2m19.6s), 200/200 VUs, 14181 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  2m20.0s/3m00.0s

running (2m20.6s), 200/200 VUs, 14284 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  2m21.0s/3m00.0s

running (2m21.6s), 200/200 VUs, 14361 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  2m22.0s/3m00.0s

running (2m22.6s), 200/200 VUs, 14456 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  2m23.0s/3m00.0s

running (2m23.6s), 200/200 VUs, 14533 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  2m24.0s/3m00.0s

running (2m24.6s), 200/200 VUs, 14638 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  2m25.0s/3m00.0s

running (2m25.6s), 200/200 VUs, 14751 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  2m26.0s/3m00.0s

running (2m26.6s), 200/200 VUs, 14868 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  2m27.0s/3m00.0s

running (2m27.6s), 200/200 VUs, 14987 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  2m28.0s/3m00.0s

running (2m28.6s), 200/200 VUs, 15101 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  2m29.0s/3m00.0s

running (2m29.6s), 200/200 VUs, 15192 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  2m30.0s/3m00.0s

running (2m30.6s), 200/200 VUs, 15318 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  2m31.0s/3m00.0s

running (2m31.6s), 200/200 VUs, 15441 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  2m32.0s/3m00.0s

running (2m32.6s), 200/200 VUs, 15548 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  2m33.0s/3m00.0s

running (2m33.6s), 200/200 VUs, 15643 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  2m34.0s/3m00.0s

running (2m34.6s), 200/200 VUs, 15693 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  2m35.0s/3m00.0s

running (2m35.6s), 200/200 VUs, 15801 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  2m36.0s/3m00.0s

running (2m36.6s), 200/200 VUs, 15907 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  2m37.0s/3m00.0s

running (2m37.6s), 200/200 VUs, 16015 complete and 0 interrupted iterations
default   [  88% ] 200/200 VUs  2m38.0s/3m00.0s

running (2m38.6s), 200/200 VUs, 16139 complete and 0 interrupted iterations
default   [  88% ] 200/200 VUs  2m39.0s/3m00.0s

running (2m39.6s), 200/200 VUs, 16259 complete and 0 interrupted iterations
default   [  89% ] 200/200 VUs  2m40.0s/3m00.0s

running (2m40.6s), 197/200 VUs, 16365 complete and 0 interrupted iterations
default   [  89% ] 197/200 VUs  2m41.0s/3m00.0s

running (2m41.6s), 190/200 VUs, 16474 complete and 0 interrupted iterations
default   [  90% ] 190/200 VUs  2m42.0s/3m00.0s

running (2m42.6s), 179/200 VUs, 16594 complete and 0 interrupted iterations
default   [  91% ] 179/200 VUs  2m43.0s/3m00.0s

running (2m43.6s), 169/200 VUs, 16696 complete and 0 interrupted iterations
default   [  91% ] 169/200 VUs  2m44.0s/3m00.0s

running (2m44.6s), 161/200 VUs, 16803 complete and 0 interrupted iterations
default   [  92% ] 161/200 VUs  2m45.0s/3m00.0s

running (2m45.6s), 150/200 VUs, 16908 complete and 0 interrupted iterations
default   [  92% ] 150/200 VUs  2m46.0s/3m00.0s

running (2m46.6s), 140/200 VUs, 16995 complete and 0 interrupted iterations
default   [  93% ] 140/200 VUs  2m47.0s/3m00.0s

running (2m47.6s), 129/200 VUs, 17079 complete and 0 interrupted iterations
default   [  93% ] 129/200 VUs  2m48.0s/3m00.0s

running (2m48.4s), 117/200 VUs, 17191 complete and 0 interrupted iterations
default   [  94% ] 117/200 VUs  2m49.0s/3m00.0s

running (2m49.4s), 109/200 VUs, 17292 complete and 0 interrupted iterations
default   [  94% ] 109/200 VUs  2m50.0s/3m00.0s

running (2m50.4s), 097/200 VUs, 17399 complete and 0 interrupted iterations
default   [  95% ] 097/200 VUs  2m51.0s/3m00.0s

running (2m51.4s), 084/200 VUs, 17500 complete and 0 interrupted iterations
default   [  96% ] 084/200 VUs  2m52.0s/3m00.0s

running (2m52.4s), 072/200 VUs, 17619 complete and 0 interrupted iterations
default   [  96% ] 072/200 VUs  2m53.0s/3m00.0s

running (2m53.4s), 065/200 VUs, 17735 complete and 0 interrupted iterations
default   [  97% ] 065/200 VUs  2m54.0s/3m00.0s

running (2m54.4s), 054/200 VUs, 17863 complete and 0 interrupted iterations
default   [  97% ] 054/200 VUs  2m55.0s/3m00.0s

running (2m55.4s), 046/200 VUs, 17991 complete and 0 interrupted iterations
default   [  98% ] 046/200 VUs  2m56.0s/3m00.0s

running (2m56.4s), 032/200 VUs, 18117 complete and 0 interrupted iterations
default   [  98% ] 032/200 VUs  2m57.0s/3m00.0s

running (2m57.4s), 023/200 VUs, 18216 complete and 0 interrupted iterations
default   [  99% ] 023/200 VUs  2m58.0s/3m00.0s

running (2m58.4s), 011/200 VUs, 18308 complete and 0 interrupted iterations
default   [  99% ] 011/200 VUs  2m59.0s/3m00.0s

running (2m59.4s), 001/200 VUs, 18395 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  3m00.0s/3m00.0s

     ✓ status 200

     checks.........................: 100.00% 18396 out of 18396
     data_received..................: 269 MB  1.5 MB/s
     data_sent......................: 2.2 MB  12 kB/s
     http_req_blocked...............: avg=23.72µs  min=1µs         med=5.93µs   max=75.9ms  p(90)=8.39µs  p(95)=11.64µs
     http_req_connecting............: avg=14.06µs  min=0s          med=0s       max=75.82ms p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=1.06s    min=110.22µs    med=954.83ms max=7.55s   p(90)=2.1s    p(95)=2.33s  
       { expected_response:true }...: avg=1.06s    min=110.22µs    med=954.83ms max=7.55s   p(90)=2.1s    p(95)=2.33s  
     http_req_failed................: 0.00%   0 out of 18396
     http_req_receiving.............: avg=629.77µs min=-83619735ns med=338.43µs max=27.13ms p(90)=1.01ms  p(95)=2.09ms 
     http_req_sending...............: avg=35.83µs  min=4.11µs      med=18.68µs  max=19.42ms p(90)=37.52µs p(95)=50.54µs
     http_req_tls_handshaking.......: avg=0s       min=0s          med=0s       max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=1.06s    min=0s          med=954.19ms max=7.55s   p(90)=2.1s    p(95)=2.33s  
     http_reqs......................: 18396   102.491181/s
     iteration_duration.............: avg=1.06s    min=39.56ms     med=955.62ms max=7.55s   p(90)=2.11s   p(95)=2.34s  
     iterations.....................: 18396   102.491181/s
     list_latency...................: avg=1.06s    min=110.22µs    med=954.83ms max=7.55s   p(90)=2.1s    p(95)=2.33s  
     vus............................: 1       min=1              max=200
     vus_max........................: 200     min=200            max=200


running (2m59.5s), 000/200 VUs, 18396 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  3m0s